Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.Prepend Method (LineSegment)
 Prepends a line segment to the geometry list
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolycurveGeometryBuilder Prepend(
	LineSegment segment
)
Public Function Prepend (
	segment As LineSegment
) As PolycurveGeometryBuilder
Parameters
segment
Type: Tekla.Structures.Geometry3d.LineSegment
Geometry to prepend
Return Value
Type: PolycurveGeometryBuilder
The builder itself
See Also
Reference
PolycurveGeometryBuilder Class
Prepend Overload
Tekla.Structures.Geometry3d Namespace